tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "homebrew-ffmpeg/ffmpeg"
tap "laishulu/homebrew"
tap "minacle/chntpw"
tap "railwaycat/emacsmacport"
brew "glib"
brew "pixman"
brew "zstd"
brew "openjdk"
brew "ammonite-repl"
brew "llvm"
brew "snappy"
brew "apache-arrow"
brew "openjdk@21"
brew "apache-spark"
brew "aria2"
brew "autoconf"
brew "automake"
brew "python@3.13"
brew "awscli"
brew "bear"
brew "btop"
brew "cabextract"
brew "cdrtools"
brew "ffmpeg", args: ["with-fdk-aac"]
brew "flac"
brew "gnutls"
brew "libssh"
brew "cmake"
brew "lima"
brew "colima"
brew "coreutils"
brew "datamash"
brew "deno"
brew "docbook"
brew "docker"
brew "docker-machine"
brew "docutils"
brew "duckdb"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "go-md2man"
brew "go-parquet-tools"
brew "pkgconf"
brew "gobject-introspection"
brew "gotop"
brew "gradle-completion"
brew "gradle"
brew "librsvg"
brew "gstreamer"
brew "gzip"
brew "htop"
brew "icu4c@76"
brew "iftop"
brew "libheif"
brew "imagemagick"
brew "jansson"
brew "jenv"
brew "jpeg"
brew "jq"
brew "kubernetes-cli"
brew "libffi"
brew "libgccjit"
brew "libmagic"
brew "libxml2"
brew "qemu"
brew "lima-additional-guestagents"
brew "mactop"
brew "mas"
brew "mise"
brew "mlx"
brew "mpd"
brew "msmtp"
brew "mu"
brew "neovim"
brew "nerdfetch"
brew "nghttp2"
brew "ninja"
brew "node"
brew "nvtop"
brew "ollama"
brew "openjdk@17"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "parquet-cli"
brew "playwright-mcp"
brew "pv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "pytorch"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sendemail"
brew "starship"
brew "telnet"
brew "texinfo"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unzip"
brew "uv"
brew "wget"
brew "wimlib"
brew "yarn"
brew "yarn-completion"
brew "yq"
brew "zellij"
brew "zip"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "coursier/formulas/coursier"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-compress-install", "with-imagemagick", "with-mailutils", "with-xwidgets"]
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
brew "laishulu/homebrew/macism"
brew "minacle/chntpw/chntpw"
cask "adobe-acrobat-reader"
cask "amazon-chime"
cask "android-file-transfer"
cask "beyond-compare"
cask "claude"
cask "container"
cask "crystalfetch"
cask "cyberduck"
cask "discord"
cask "firefox"
cask "font-bitstream-vera"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sarasa-gothic"
cask "font-symbols-only-nerd-font"
cask "garmin-express"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-earth-pro"
cask "google-japanese-ime"
cask "iterm2"
cask "keepassxc"
cask "losslessswitcher"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "millie"
cask "miro"
cask "nordvpn"
cask "notion"
cask "orion"
cask "plex-media-server"
cask "qobuz"
cask "remarkable"
cask "slack"
cask "spotify"
cask "stats"
cask "telegram"
cask "temurin"
cask "temurin@11"
cask "temurin@17"
cask "temurin@21"
cask "temurin@8"
cask "the-clock"
cask "the-unarchiver"
cask "tunnelblick"
cask "usb-overdrive"
cask "utm"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vox"
cask "vox-preferences-pane"
cask "zoom"
mas "Blackmagic Disk Speed Test", id: 425264550
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "gerane.theme-zenburn"
vscode "mattn.lisp"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "ryanolsonx.zenburn"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
cargo "cargo-audit"
cargo "cargo-expand"
cargo "cargo-outdated"
